#### Task 1

In [1]:
import pandas as pd


df = pd.read_csv('students.csv')

In [4]:
df[df['Город'] == 'Минск']

       Имя  Возраст  Город  Оценка
0  Алексей       25  Минск     4.5
3    Ольга       28  Минск     4.2

In [7]:
df.groupby('Город')['Оценка'].mean()

Город
Минск              4.35
Москва             3.80
Санкт-Петербург    5.00
Name: Оценка, dtype: float64

#### Task 2

In [11]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [20, 21, 22, 20, 21],
    'Grade': [9, 8, 7, 10, 6]
}

df = pd.DataFrame(data)

In [13]:
df['Name'].count()
df.shape[0]

5

In [14]:
df['Age'].mean()

np.float64(20.8)

In [15]:
df[df['Grade'] > 8]

    Name  Age  Grade
0  Alice   20      9
3  David   20     10

#### Task 3

In [23]:
# Adding to df
data = {
    'Product': ['Apple', 'Banana', 'Orange', 'Milk', 'Bread'],
    'Quantity': [100, 80, 60, 40, 90],
    'Price': [1.0, 0.5, 0.8, 2.5, 1.2]
}

df = pd.DataFrame(data)
df

  Product  Quantity  Price
0   Apple       100    1.0
1  Banana        80    0.5
2  Orange        60    0.8
3    Milk        40    2.5
4   Bread        90    1.2

In [25]:
# Adding column total

df['Total'] = df['Quantity'] * df['Price']

In [26]:
df

  Product  Quantity  Price  Total
0   Apple       100    1.0  100.0
1  Banana        80    0.5   40.0
2  Orange        60    0.8   48.0
3    Milk        40    2.5  100.0
4   Bread        90    1.2  108.0

In [20]:
# Overall revenue

print(df['Total'].sum())

396.0

In [22]:
# products with items sold > 50

df['Product'][df['Quantity'] > 50]

0     Apple
1    Banana
2    Orange
4     Bread
Name: Product, dtype: object

#### Task 4

In [28]:
# Adding to df
df = pd.read_csv('hw_DE_12.csv')

df

,id,first_name,last_name,email,gender,ip_address
0,1,Zebulon,Sheara,zsheara0@buzzfeed.com,Male,26.254.115.173
1,2,Gabby,Hundy,ghundy1@dyndns.org,Male,86.222.142.186
2,3,Zaneta,Macewan,zmacewan2@dyndns.org,Female,20.98.185.65
3,4,Linn,Steely,lsteely3@psu.edu,Male,65.253.237.106
4,5,Althea,Segar,asegar4@prlog.org,Female,25.127.235.34
...,...,...,...,...,...,...
995,996,Zsa zsa,McGarahan,zmcgarahanrn@craigslist.org,Female,208.135.43.154
996,997,Al,Villiers,avilliersro@nydailynews.com,Agender,168.3.4.142
997,998,Natalina,Clavering,nclaveringrp@jugem.jp,Female,16.223.145.44
998,999,Gretta,Witheford,gwithefordrq@discovery.com,Female,61.83.241.246
999,1000,Tadio,Feighney,tfeighneyrr@google.es,Male,154.243.103.8

In [31]:
import numpy as np


# adding column with random numbers
df['age'] = np.random.randint(18, 66, size=len(df))

In [32]:
df

,id,first_name,last_name,email,gender,ip_address,age
0,1,Zebulon,Sheara,zsheara0@buzzfeed.com,Male,26.254.115.173,53
1,2,Gabby,Hundy,ghundy1@dyndns.org,Male,86.222.142.186,44
2,3,Zaneta,Macewan,zmacewan2@dyndns.org,Female,20.98.185.65,43
3,4,Linn,Steely,lsteely3@psu.edu,Male,65.253.237.106,26
4,5,Althea,Segar,asegar4@prlog.org,Female,25.127.235.34,50
...,...,...,...,...,...,...,...
995,996,Zsa zsa,McGarahan,zmcgarahanrn@craigslist.org,Female,208.135.43.154,43
996,997,Al,Villiers,avilliersro@nydailynews.com,Agender,168.3.4.142,60
997,998,Natalina,Clavering,nclaveringrp@jugem.jp,Female,16.223.145.44,32
998,999,Gretta,Witheford,gwithefordrq@discovery.com,Female,61.83.241.246,29
999,1000,Tadio,Feighney,tfeighneyrr@google.es,Male,154.243.103.8,28

In [33]:
youth_df = df[(df.age >= 18) & (df.age <= 25)]

youth_df

,id,first_name,last_name,email,gender,ip_address,age
5,6,Poppy,Kinnard,pkinnard5@mozilla.org,Female,246.66.172.88,20
12,13,Conrad,Ceillier,cceillierc@squarespace.com,Male,77.176.126.146,19
16,17,Humfried,Ohanessian,hohanessiang@wufoo.com,Male,16.207.33.214,19
19,20,Donal,Cosgrove,dcosgrovej@walmart.com,Male,234.120.141.220,19
24,25,Sterling,Cheke,schekeo@baidu.com,Polygender,55.50.211.191,20
...,...,...,...,...,...,...,...
939,940,Alic,Swatridge,aswatridgeq3@yandex.ru,Male,208.76.170.20,23
948,949,Ludovika,Nyssens,lnyssensqc@facebook.com,Female,59.146.200.64,23
964,965,Drake,Garriock,dgarriockqs@google.fr,Male,228.83.150.83,24
982,983,Urban,Kerkham,ukerkhamra@patch.com,Male,240.171.37.254,20
984,985,Lula,Almon,lalmonrc@nationalgeographic.com,Female,142.209.10.99,18

In [34]:
adults_df = df[(df.age >= 26) & (df.age <= 35)]

adults_df

,id,first_name,last_name,email,gender,ip_address,age
3,4,Linn,Steely,lsteely3@psu.edu,Male,65.253.237.106,26
20,21,Abbott,Cumberledge,acumberledgek@aboutads.info,Male,8.228.130.210,31
26,27,Nanon,Lamblin,nlamblinq@networksolutions.com,Female,52.234.189.243,33
29,30,Reynard,Breeton,rbreetont@nhs.uk,Male,35.207.155.210,35
37,38,Rahal,Polly,rpolly11@soup.io,Female,74.143.141.169,26
...,...,...,...,...,...,...,...
980,981,Pennie,Itzhaki,pitzhakir8@wiley.com,Female,186.15.175.207,27
983,984,Claudina,Savery,csaveryrb@smh.com.au,Non-binary,135.123.30.141,34
997,998,Natalina,Clavering,nclaveringrp@jugem.jp,Female,16.223.145.44,32
998,999,Gretta,Witheford,gwithefordrq@discovery.com,Female,61.83.241.246,29
999,1000,Tadio,Feighney,tfeighneyrr@google.es,Male,154.243.103.8,28

In [35]:
true_adults_df = df[(df.age >= 36) & (df.age <= 50)]

true_adults_df

,id,first_name,last_name,email,gender,ip_address,age
1,2,Gabby,Hundy,ghundy1@dyndns.org,Male,86.222.142.186,44
2,3,Zaneta,Macewan,zmacewan2@dyndns.org,Female,20.98.185.65,43
4,5,Althea,Segar,asegar4@prlog.org,Female,25.127.235.34,50
6,7,Tanhya,Allabarton,tallabarton6@eepurl.com,Female,71.244.198.196,44
7,8,Anetta,Herety,aherety7@github.io,Female,40.45.249.248,45
...,...,...,...,...,...,...,...
979,980,Terri-jo,Gethins,tgethinsr7@networksolutions.com,Female,196.60.133.98,43
987,988,Krystal,Farney,kfarneyrf@irs.gov,Female,53.74.126.116,36
992,993,Chantalle,Mogra,cmogrark@etsy.com,Agender,7.157.7.35,43
993,994,Morganica,Pierton,mpiertonrl@epa.gov,Female,150.213.150.57,45
995,996,Zsa zsa,McGarahan,zmcgarahanrn@craigslist.org,Female,208.135.43.154,43

In [36]:
hardcore_adults_df = df[df.age >= 51]

hardcore_adults_df

,id,first_name,last_name,email,gender,ip_address,age
0,1,Zebulon,Sheara,zsheara0@buzzfeed.com,Male,26.254.115.173,53
8,9,Kaile,Clementson,kclementson8@rediff.com,Female,147.21.239.61,51
9,10,Blanche,Akehurst,bakehurst9@newsvine.com,Female,219.148.148.134,64
10,11,Melosa,Boneham,mbonehama@quantcast.com,Female,176.120.71.216,56
15,16,Mamie,Wainwright,mwainwrightf@studiopress.com,Female,163.100.199.174,55
...,...,...,...,...,...,...,...
989,990,Francesca,Shorrock,fshorrockrh@creativecommons.org,Female,168.4.169.89,58
990,991,Boone,Gerrey,bgerreyri@amazon.de,Male,191.139.46.86,64
991,992,Chaunce,Askie,caskierj@fc2.com,Male,36.3.185.58,63
994,995,Ibbie,Appleby,iapplebyrm@alibaba.com,Genderqueer,236.77.139.163,62
996,997,Al,Villiers,avilliersro@nydailynews.com,Agender,168.3.4.142,60

In [37]:
youth_df.shape[0]

161

In [38]:
adults_df.shape[0]

227

In [39]:
true_adults_df.shape[0]

324

In [40]:
hardcore_adults_df.shape[0]

288

In [41]:
print(youth_df['age'].mean())

21.496894409937887

In [42]:
print(adults_df['age'].mean())

30.651982378854626

In [43]:
print(true_adults_df['age'].mean())

43.03703703703704

In [44]:
print(hardcore_adults_df['age'].mean())

58.39930555555556